# RemoveCutBetweenSolids Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidSolidCutUtils..::..RemoveCutBetweenSolids Method
SolidSolidCutUtils Class See Also
---
Removes the solid-solid cut between the two elements if it exists.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static void RemoveCutBetweenSolids(
	Document document,
	Element first,
	Element second
)
```

Visual Basic
---
```text
Public Shared Sub RemoveCutBetweenSolids ( _
	document As Document, _
	first As Element, _
	second As Element _
)
```

Visual C++
---
```text
public:
static void RemoveCutBetweenSolids(
	Document^ document,
	Element^ first,
	Element^ second
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document containing the two elements
first
    Type: Autodesk.Revit.DB..::..Element The solid being cut or the cutting solid.
second
    Type: Autodesk.Revit.DB..::..Element The solid being cut or the cutting solid.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SolidSolidCutUtils Class
Autodesk.Revit.DB Namespace